ШоурумМагазин/src/Documents/ОплатаАренды/ОплатаАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаАренды</name>
  <registerRecords>AccumulationRegister.РасчетПоАренде</registerRecords>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Полка</name>
    <type>
      <types>CatalogRef.ПолкиИСтеллажи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ШоурумМагазин/src/AccumulationRegisters/РасчетПоАренде/РасчетПоАренде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетПоАренде</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полка</name>
    <type>
      <types>CatalogRef.ПолкиИСтеллажи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ШоурумМагазин/src/Documents/ОплатаАренды/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетПоАренде Расход
	Движения.РасчетПоАренде.Записывать = Истина;
	Движение = Движения.РасчетПоАренде.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Мастер = Мастер;
	Движение.Полка = Полка;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
